app/Filters/isLoggedIn.php

    public function before(RequestInterface $request, $arguments = null)
    {

        $this->db = \Config\Database::connect();
        $session = session();
        $router = service('router');
        $method = $router->methodName();
        if (!$session->get('adminid'))
        {
            if($method!= "login")
            {

                return redirect()->to(site_url('login'));
            }
        }else{

            if ($this->db->tableExists('tbl_admin'))
            {
                $count = $this->db->table('tbl_admin')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_admin`