app/Controllers/Adminconfiguration.php

INSERT INTO `tbl_admin` (`firstname`, `lastname`, `email`, `phonenumber`, `password`, `role`, `created_at`) VALUES ('benwork', 'benwork', 'benwork@noemail.com', 'n/a', '$2y$14$WBrY3687B4732TfCG1y10u.t8qxGP0C0nI9ly7FHywQPUCn/7zAsO', 0, '2023-07-27 16:39:44')
---
                'created_at' => date("Y-m-d H:i:s"),
            ];

            $result = $this->adminconfigurationmodel->set($posdata)->insert();