app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger){
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        /************* libraries load here *****************/
        $this->session    =  \Config\Services::session();
        $this->db         =  \Config\Database::connect();
        $this->encrypter  =  \Config\Services::encrypter();
        $this->migrate    =  \Config\Services::migrations();
        $this->forge      =  \Config\Database::forge();
        $this->security   =  \Config\Services::security();
        /************* libraries End here *******************/


        /***************** Models Load here *******************/
        $this->loginmodel              = new Loginmodel();
        $this->adminconfigurationmodel = new Adminconfigurationmodel();
        $this->apimodel                = new Apimodel();
        /***************** Models End here **********************/

        $router = service('router');
        $method = $router->methodName();
        $this->checkdbconnection();

        /****************** Validating Registration Start Here *****************/
        if ($this->db->tableExists('tbl_admin')){
            $count = $this->db->table('tbl_admin')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_admin`

        }
        if($method != 'adminconfiguration'){
            if ($this->db->tableExists('tbl_admin')){
                $count = $this->db->table('tbl_admin')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_admin`