app/Models/Adminconfigurationmodel.php

	public function getadmindetailsbyadminid($id) {
		$returndata = array();
		$returndata = $this->where('id', $id)->get()->getResult();
---
SELECT *
FROM `tbl_admin`
WHERE `id` = '2'